Revit 2024 API
Document.EnableWorksharing Method
 Enables worksharing in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void EnableWorksharing(
	string worksetNameGridLevel,
	string worksetName
)
Visual Basic
Public Sub EnableWorksharing ( _
	worksetNameGridLevel As String, _
	worksetName As String _
)
Visual C++
public:
void EnableWorksharing(
	String^ worksetNameGridLevel,
	String^ worksetName
)
Parameters
worksetNameGridLevel
Type: System.String
 Name of workset for grids and levels.
worksetName
Type: System.String
 Name of workset for all other elements.
Remarks
 The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  worksetNameGridLevel is an empty string. -or- worksetName is an empty string. -or- worksetNameGridLevel cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- worksetName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
Autodesk.Revit.Exceptions.InvalidOperationException |  The document does not allow worksharing to be enabled. -or- This Document is in an edit mode. -or- This Document is a workshared document. -or- There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Autodesk.Revit.Exceptions.OperationCanceledException |  Enabling worksharing was cancelled.
See Also
Document Class
Autodesk.Revit.DB Namespace